# AddCriterion Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoutingPreferenceRule..::..AddCriterion Method
RoutingPreferenceRule Class See Also
---
Adds a new routing criterion.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void AddCriterion(
	RoutingCriterionBase myCriterion
)
```

Visual Basic
---
```text
Public Sub AddCriterion ( _
	myCriterion As RoutingCriterionBase _
)
```

Visual C++
---
```text
public:
void AddCriterion(
	RoutingCriterionBase^ myCriterion
)
```

# ### Parameters
myCriterion
    Type: Autodesk.Revit.DB..::..RoutingCriterionBase The criterion to add.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also
RoutingPreferenceRule Class
Autodesk.Revit.DB Namespace